In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn import metrics

In [2]:
data = pd.read_csv('train.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
target = data['Survived']
data =data.drop('Survived',axis=1)

In [5]:
data.fillna(0,inplace=True)

In [6]:
data = data.drop(['Name','SibSp','Ticket','Cabin','Embarked','Parch','Pclass'],axis=1)

In [7]:
data

     PassengerId     Sex   Age     Fare
0              1    male  22.0   7.2500
1              2  female  38.0  71.2833
2              3  female  26.0   7.9250
3              4  female  35.0  53.1000
4              5    male  35.0   8.0500
..           ...     ...   ...      ...
886          887    male  27.0  13.0000
887          888  female  19.0  30.0000
888          889  female   0.0  23.4500
889          890    male  26.0  30.0000
890          891    male  32.0   7.7500

[891 rows x 4 columns]

In [8]:
data.fillna(0.0)

     PassengerId     Sex   Age     Fare
0              1    male  22.0   7.2500
1              2  female  38.0  71.2833
2              3  female  26.0   7.9250
3              4  female  35.0  53.1000
4              5    male  35.0   8.0500
..           ...     ...   ...      ...
886          887    male  27.0  13.0000
887          888  female  19.0  30.0000
888          889  female   0.0  23.4500
889          890    male  26.0  30.0000
890          891    male  32.0   7.7500

[891 rows x 4 columns]

In [9]:
data['Sex'].replace('female',0,inplace=True)

In [10]:
data['Sex'].replace('male',1,inplace=True)

In [11]:
data

     PassengerId  Sex   Age     Fare
0              1    1  22.0   7.2500
1              2    0  38.0  71.2833
2              3    0  26.0   7.9250
3              4    0  35.0  53.1000
4              5    1  35.0   8.0500
..           ...  ...   ...      ...
886          887    1  27.0  13.0000
887          888    0  19.0  30.0000
888          889    0   0.0  23.4500
889          890    1  26.0  30.0000
890          891    1  32.0   7.7500

[891 rows x 4 columns]

In [12]:
from sklearn.tree import DecisionTreeClassifier

In [13]:
clf = DecisionTreeClassifier()

In [14]:
clf.fit(data,target)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [15]:
predict =clf.predict(data)

In [16]:
acc = metrics.accuracy_score(predict,target)

In [17]:
acc

0.7822671156004489

In [18]:
from sklearn.model_selection import GridSearchCV
parameters ={criterion :[gini”, "ntropy"],
            'max_iter': [100,200,300],
             'multi_class':['auto','ovr','multinomial']}
scorer = metrics.make_scorer(metrics.f1_score)
grid_obj = GridSearchCV(clf,parameters,scoring=scorer)
grid_fit = grid_obj.fit(data,target)
best_clf = grid_fit.best_estimator_

In [19]:
best_clf.fit(data,target)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='multinomial', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [20]:
predict = best_clf.predict(data)

In [21]:
metrics.accuracy_score(target,predict)

0.7822671156004489

In [24]:
test = pd.read_csv('test.csv')
test = test.drop(['Name','SibSp','Ticket','Cabin','Embarked','Parch','Pclass'],axis=1)

In [28]:
test['Sex'].replace('female',0,inplace=True)
test['Sex'].replace('male',1,inplace=True)

In [29]:
test

     PassengerId  Sex   Age      Fare
0            892    1  34.5    7.8292
1            893    0  47.0    7.0000
2            894    1  62.0    9.6875
3            895    1  27.0    8.6625
4            896    0  22.0   12.2875
..           ...  ...   ...       ...
413         1305    1   NaN    8.0500
414         1306    0  39.0  108.9000
415         1307    1  38.5    7.2500
416         1308    1   NaN    8.0500
417         1309    1   NaN   22.3583

[418 rows x 4 columns]

In [33]:
test = test.fillna(0.0)
test_predict = best_clf.predict(test)

In [34]:
sub = pd.DataFrame({'PassengerId':test['PassengerId'],'Survived':test_predict})
sub.to_csv('New.csv',index=False)